# Καλούμε την matplotlib βιβλιοθήκη, η οποία θα χρησιμοποιηθεί για την δημιουργία του ταλαντογραφήματος

import matplotlib.pyplot as matpl


# Δημιουργούμε μια μέθοδο η οποία θα δέχεται ως ΕΙΣΟΔΟ το σήμα του παλμογράφου.
# Θα αποθηκεύει την μέγιστη τιμή που είναι η συστολική πίεση
# Θα αποθηκεύει την ελάχιστη τιμή που είναι η διαστολική πίεση
# Θα υπολογίζει και θα ΕΠΙΣΤΡΕΦΕΙ την συστολική, την διαστολική και την μέση πίεση (MAP),
#   η οποία είναι το άθροισμα των τιμών του πίνακα των σημάτων διά το μέγεθος του αντιστοίχου πίνακα
def calculate_blood_pressure(signal):
    systolic_pressure = max(signal)
    diastolic_pressure = min(signal)
    mesi_piesi = sum(signal) / len(signal)

    return systolic_pressure, diastolic_pressure, mesi_piesi


# Εδώ δημιουργούμε το ταλαντογράφημα
# Στον άξονα Χ τοποθετούμε τον χρόνο
# Στον άξονα Υ τοποθετούμε την πίεση
# Στο ίδιο γράφημα τοποθετούμε και μια ευθεία γραμμή η οποία είναι η MAP
def create_talantografima(signal, mean_pressure):
    matpl.plot(signal, label='Σήμα Πίεσης')
    matpl.axhline(y=mean_pressure, color='r', linestyle='--', label=f'MAP: {mean_pressure} mmHg')
    matpl.title('Ταλαντογράφημα')
    matpl.xlabel('Χρόνος')
    matpl.ylabel('Πίεση')
    matpl.legend()
    matpl.show()


# Εδώ δημιουργούμε τον πίνακα, όπου τοποθετούμε διάφορες τιμές της πίεσης σε διάφορα χρονικά διαστήματα
pressure_signal = [80, 90, 100, 140, 110, 95, 85, 75, 70, 80, 80, 90, 100, 140, 110, 95, 85, 75, 70, 80, 80, 90, 100,
                   140, 110, 95, 85, 75, 70]

# Εδώ καλούμε την μέθοδο με την οποία θα γίνει ο υπολογισμός της συστολικής, διαστολικής και μέσης αρτηριακής πίεσης
#  χρησιμοποιώντας τον πίνακα τιμών σημάτων που ορίσαμε παραπάνω 
systolic, diastolic, mesi_piesi = calculate_blood_pressure(pressure_signal)

# Εδώ εμφανίζουμε τα αποτελέσματα υπολογισμού της συστολικής, της διαστολικής πίεσης και της MAP
print(f'Συστολική Πίεση: {systolic} mmHg')
print(f'Διαστολική Πίεση: {diastolic} mmHg')
print(f'Μέση Αρτηριακή Πίεση (MAP): {mesi_piesi} mmHg')
print(" ")

# Σύμφωνα με τα ιατρικά δεδομένα, αναλόγως τι τιμές έχουν η συστολική και η διαστολική πίεση αντίστοιχα
# το πρόγραμμα θα εμφανίζει στον χρήστη και ένα μήνυμα που θα τον ενημερώνει αν η πίεση του είναι
# σε φυσιολογικά επίπεδα η ΟΧΙ

if systolic < 90 or diastolic < 60:
    print("!!! Χαμηλή αρτηριακή πίεση !!!")
elif systolic <= 120 and diastolic <= 80:
    print("Φυσιολογική αρτηριακή πίεση")
elif 120 < systolic < 129 and diastolic < 80:
    print("!!! Αυξημένη αρτηριακή πίεση !!!")
elif systolic >= 130 or diastolic > 80:
    print("!!! Υψηλή αρτηριακή πίεση !!!")
elif systolic >= 130 or diastolic > 80:
    print("!!! Μεμονωμένη συστολική υπέρταση !!!")

# Εδώ καλούμε την μέθοδο που δημιουργεί το ταλαντογράφημα, δινοντας ως εισοδο
# το σημα της πιεσης (απ τον πινακα με τα σηματα) και την μεση πιεση
create_talantografima(pressure_signal, mesi_piesi)
